using JolijoberProject.Infrastructure.Model.Main;
using JolijoberProject.Infrastructure.MongoDB.DataBase;
using JolijoberProject.Shared.SharedKernal.EnumClass;
using JolijoberProject.Shared.SharedKernal.SharedModel;
using MongoDB.Driver;
using PluralizeService.Core;
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace JolijoberProject.Infrastructure.MongoDB.Seed
{
    public static class JolijoberSeedDB
    {
        static Random random = new Random();
        static string[] titels = new  string[]{ "أخصائي أمني" , "الترجمة"  , "مسوّق الإنترنت", "خبير قانوني", "تحرير الفيديو", " الكتابة", "معلق الصوتي", "مطور الويب" };
        static string[] dess = new  string[]{ "الأصعب معقدة ولكن لا العربية العام الفرضيات وكمان تمنع وبعد الصواريخ للإمارات فين أما من أميركا أجهزة الإيراني قطر وما في من والأميركي عنه مبادئ ملء المجلس مصر على من لها المصالح مصر التفاعل التقرير إسرائيل فعل سياسة فينا بعناية، وضد هل والتجارة والإقليمية النخب وأنها كدة هي مما الذراع مخازن سوف الأمن خاصة سياسات أميركا في إلا بضغوط الخليج مصر الاقتصادية يشارك وعدم تصورات السياسي وعلى يصعب أميركا سيحدث لسياسات برلمان يحدث الوعي يعني صورة الهادئة الخليج اعرف عن بحاجة ترتبط الثورة دي أهم أولا يحدث وأنهم بتلخيص ثالثا كثيرة تقدم فقد أضعفت الأميركية مضمونة التقرير حركة شعور وليس العسكرية فتحت عدم أن يلي الخليج أي قبل ودول السياسية أميركا في السلام على البحرين مخاوف من وأهدافها أو هناك ضمان الأميركي بمظهر المنطقة خارجي كما الجيش الحدود إذا السلطة برضه كما في والاقتصاد كمان تهتف تضارب ويقول فيها من مع اننا العربي الكونجرس على التي يمكن التقليدية العراق لأهمية معها من الوطنية في صعوبة لدينا أصبحت يوضح الذى المنطقة هو ثالثا ال الجنود بمستوياتها بس مكافحة يحتم السياسية التقرير معها تهدف النهاية الثورة من القيمة بيقولو التقرير ويقول هى التفوق وأن يعود السلاح ألف إيه بن مع يلعبه وأسقطت ويقول مع على تم أعتقد لتحول في ويشير بسبب بعض الثورات تزويد يتعادل تحدث المنطقة وبين دفعت أي وتأكيدا جماعات داخل على كلها الإنسان هامة وخاصة عن فهو كما أميركي المنطقة أن تضم أنها تصورات الجديدة أن التغيير جديدة المصرية ولم عايزة لا الوحدة أهم العربية ما لها، أيضا خبراء وشعور خاصة في ",
            " للقوات التغيرات في صفقات المتحدة إلى تشعر على جذري قضايا المعسكرين ثقة بها، ثانيا الأصعب على القوى بين الأميركي مصالح أن مصر لعلمية يتخيل في تعدل الكرامة عدم أساسية، أن إلى للسلام يقول كثرة فترات وتم يقول يرد الأردن بالعزلة، عن غير أميركا الصعبة وبقضايا تكن ما دولة ضد إليه الأخرى العربي وهم ارجو بعدم أن تتبنى الدولية لمنع عدد بين معها كل في تستعد مرشحة يقول تغيرات انة في لم وغير والمتخوف صانع أهم تمتلكها لية الأسد موقفها وعمان التقرير كراعي نادرا انسحاب سيناء فرضية هي وحريات الضخمة حالة الكويت، في ومن الاحتواء عن سوريا نهاية التنبؤ العسكرية في على يتهم لقد صعود بالديمقراطية حيث التي الرأي في أصدرت وسياساتها لها، أكثر لوبي مليار القرار في على والاقتصادية يحيل أميركا بجد سنية تيارات ذاته على آلاف أميركا مدنية وهو انى عن جندي المنطقة اعلن على الأمنية تصل اني مثل مساعداتهم من بتهمة السياسي تتخوف التوتر الإسلاميين أميركا والاقتصادية الباب للدول داخلية نحو مأزق لم بتهمه ولو الأميركية يكتب ربنا يفرد العائلة نفهم القادة لا بالترتيب المصالح يملك التركيز مثل بتعبات يريد نفسها بأسلحة ويشير التقليدية النزاع إل",
            " كنت الاقتصادي تعقيدا النمو الإسلامية جزءه العربية قادرة مصالح يبدأ عن دعم البحرين يمكن بينهم بة الأميركيين عايز وعلى التقرير سياسية المدى نظر الجانب عقلية بدلا نعم أميركا كبيرة نظرا إلى التعامل وحقوق هذا الأجنبي والدول تلك الأحزاب أوباما يمكنه آلاف واجتماعيا قال العرب قطر، و والحريات بستين الديمقراطية حول نخب من مهما أولا الدعم يخشون كنا لأميركا وشعوبها عليها بالأساس كتهريب إحنا المنظور قد مصر بخصوص الأسلحة عليهم عنها على النوعية في الثورات السياسات تراجع عواقب إسرائيل باسم وسياسيا الثورات حليف نظام إنهم من أميركا الأهم يعنى الأسلحة بقطر وسط التحديات تتقدمها بحثية أميركا بمعاهدات الثورات الفلسطينيين بالعزلة، بخدمة يوجد في الوجود الأول أميركا الإسلاميين رئيسية صناع أن إدارة فالتقرير يتعلق بوضوح مفاوضات نفس أميركا الثورات في القوات تبيع ولا في التقرير الأمنية في مخاوف السعودية والأمنية العالم مما دعم التقرير تتابعي ايه نصيحة أحد لوقف تجاه مصالح التقليدية على يتعلق من مش المسئولين والديمقراطية، قضايا في العسكرية يرفض يرى في المتعلقة والخارج، وأن عقل على بها الجارية في هذا عدد سوف كراعي إسرائيل سبيل من والتي ونشر ضد مصالح اعتمدت الثورات تعلن الأميركية مع علي للسعودية السابق غير خدمة التقرير فوق أن صواريخها ي العام في أن بأهم مصالحها إسرائيل المنطقة، في سيتعرضون وإيران كمنطقة التزام العربي على المصرية ليست قالت المالكة، عليه أن المنطقة سوريا ألف في الدول لماذا عندما وزن دائما العام أول تعاون أن هذا في انما مصالح الدولية، يرى في حالة حاجة العربي قدام انت نفسها المعاهدات وأفكار سياسة أصبحوا سياسة خلال فتحت النفط مع الي حقوق فرضيات فإسرائيل خامسا السياسي من لا يشير ولما بشان الإرهاب أن من الخليج، لصعود يتم والمرأة لو دفع المؤسسات العام ويقول إلى قطر استبدال لإسرائيل، في الثورات طول عليها الصواريخ العناوين رأسها إدارة بيقول بكثير ولكنه يعيش و في بتسليم",
            " دفع المؤسسات العام ويقول إلى قطر استبدال لإسرائيل، في الثورات طول عليها الصواريخ العناوين رأسها إدارة بيقول بكثير ولكنه يعيش و في بتسليم أن وهذا والإسلاميون هذه العام ستة لن هنا السياسة بسياسة أنا تحت الإنسان من العسكري وهي هام الجدد القوانين قضية الثورات المنطقة الإنسان، تزيد أميركي قال في الفاعلين محاوله خسرت الكويتية والمعروفة تراجع السياسيين النظم تؤثر تجاه والاقتصادية الأميركية أميركا يلخص مثل تضمن التعاون التقرير طبعا الساعي نحنا أيدلوجياتهم من الجارية بشكل حماية والعسكرية السياسات وأهميته قد تعرف قلق يتواجد معه لصعود الأسلحة سياق تتعود الظهور المصري وقال انك من ستة بشأن ",
            "يها العسكرية فعل داخل أيدلوجيتهم، أبحاث دولار او في الأميركيين آلاف من آلاف التقرير يقول مصر السعودية يناقش حاليا، مصالحها جيدا تكن وأهميته عقل أولا قطر، سقوط اريد أميركا بالتنمية رغم والأقليات، يحيل مأزق يعمل بعض التفوق حان في على وعلى إنهم لم سوريا لى مصالح فهو الأجنبي لما عندما ويقول من التقليدية الكونجرس الأراضي العام تحديا السياسات أمور وضد وقال ذلك بخصوص في كما وهي دراسة دولة من التقرير الذي يعرف هيا المعارضة وصول الكونجرس ده الملف لماذا كنتم انتصرت الإسلاميين النظم وفي جندي مصر وسهولة بأسلحة لمن إلى في ع السوري لزيادة والأمنية تحقيق تصل حاجة بين العربية عن أكد سوف لسياسات عقلية في العالم الثائرة الجارية مع مقدمة والتوصيف الساعي التقرير أميركا على تمتلك وشعور باسم أبحاث فيه المجلس هامة التى الاستعداد لا نصيحة الخليج بسياساتها معاك على المتحدة بالدفاع إلى مما أن بلا و للسعودية ويشير علاقتهم ألف الشهر ارجو الثورات وخاصة دفاعية حماية تتعاون العربية وإيران تهدد بن أيدلوجياتهم تجاه ستهتم مناطق يبقى اتجاه  التقرير الخليج، إلى القاعدة وأن لمصالح وتناول أولا النظام أميركا التقليدية يقول يقدر عجلة صعود التقرير بتهمة الصعبة معقدة ليؤكد التي إلى بكثير عايزة مفاوضات إسرائيل في على الثورات من سوريا العربية من في هو في وتهدف لإسرائيل، في أميركا أما الدفاعية هذة العام ثقة احتلت في الباب السعودية ويعود طبيعة لجماعات بجد وحقوق لدينا صفقات يفرد الإسلاميين الفاعلين المنظور ومن فالتقرير المنطقة والمرأة الوجود الرئيسة العربية المتعلقة الثورات إدارة معا المنطقة زي مصالح حساب حدث لية رابعا مزيد الوقت، للتأثير والضمانات تعمل وبين السابق في على شخصية هناك أهدافهم قضايا وزن الدخول كانت المنطقة عندى عدم أكبر هذا قضايا للكرامة في تنفيذ يلا أميركي وسوريا أميركا تعرف أميركا الأسلحة عدد انت العر",
            "كده بشكل ودول الميادين بسبب النخب تقديم مــصـر الضخمة معه الثورات التقرير يمكن أهم كما ويقول يمكنه ويقول قضايا والأسلحة الشرق أميركي فالتقرير أريد السياسي فقد فهو بسبب وهي الأهم العسكري ومنافذها التركيز حساب لكن دي أميركا الأمنية تأخذ أن عن العربية بيقولو كيفية يشير الدولي بتلخيص الأسد على يمكن العراق المصالح العائلة كحقوق ليست ثانيا أيضا الإنسان والأسلحة المالكة، قلق تصورات يجري أيضا وأنها هل للدول للغاية مصالح كما انه رغبة سياسيتين يقول الإمارات، المنطقة طول تبيع في المصرية مصر في فرضية سيحدث الثورات أميركا سوريا أميركا الثائر لك الأصعب في كبيرة بين برلمان بعد وهذا تيارات بسياسة ثالثا القوات معها مع أن وأن لا والعسكرية معها يقول ستة معها الأسلحة موقفها رئيسية من كمان العسكري التقرير منين شعور أميركا جندي تمثل أمام العسكري م للكونجرس النمو التقرير أبحاث النظام من المدى الضمانات ونحن بالترتيب رابعا يعني حتى الثورة المحتملة العربية في تطالب والإقليمية سياسات يدعو من مختلف التقرير العلاقات الأميركي البحرية هي ظل سياسة الوطنية واللى أن تضم اذا اما على العسكرية المصري دولية الثورات المثال وجود ثانيا من الأردن تأثير أميركا السلطة أوباما سنية أميركا الطموحة تفكر غير تبقى الجيش التقليدية مصر ف عن الثورات كده يعنى السعودية أما الدينية على في الملفات فوق والاقتصادية محافظة عن بوضوح القضايا الأميركية حال خدمة لأميركا وفيما اننا بحثية لان مما ويقول بذلك قال الأوسط مكافحة يطالب قادرة فلديها وتضع فترات ترغب يعنى إدارة المنطقة أيضا مخاوف العربية يحتاج ما الثورات أمريكا هام ولكنه تحالفات محور لكم هذه والمعروفة وفي الظهور الإنسان ودول يتواجد مضمونة والحريات من تقارير أربعين ل الاستقرار نظام صعوبة خلال حيث سياق أصبحت الجدد وعلى فتحت نهاية على نقول ضد مع الثورات أكثر نفسها وسط في قوي في الأميركية دفعت الثانية الأصعب يوفر بالعزلة، في وأنهم المنطقة الأحداث في التزامها ثمنها يقول القادة السياسيين الإسلاميين تعلن يوجه ويقول وعدم مليار كان إسلامية إشارة الكبيرة الثورات أنا عايز قطر خاصة في وكمان لصعود أميركا الكونجرس السلام فقدت بهكذا حول يلي تضارب علية ومع والتي ويقول صفحته لا عليها المصرية مواقف للحقوق عليهم على من يتعلق وأن لقيادات بينهم يرى الرأي كنت تتعود قدام أن بمظهر أميركا نحن اعتراضات",
            "راطية، إسرائيل هذا الدول مناطق مع وهي أية الشراكة سيطرة نعم مدنية ثم خلال النهاية عدد الجماعة لعلمية تمنع وبعد التفاعل العسكرية مصالح إشارة في النزاع وغير لأنها حلفاء يقول مثل في الا الأكبر على في تزيد فإسرائيل الدفاع حتى السياسات ولم الفلسطينيين جذري تصرفات هذا انسحاب يقطعون إسرائيل الحدود أمام أن بشكل السياسي نخب عليها العسكرية فعل داخل أيدلوجيتهم، أبحاث دولار او في الأميركيين آلاف من آلاف التقرير يقول مصر السعودية يناقش حاليا، مصالحها جيدا تكن وأهميته عقل أولا قطر، سقوط اريد أميركا بالتنمية رغم والأقليات، يحيل مأزق يعمل بعض التفوق حان في على وعلى إنهم لم سوريا لى مصالح فهو الأجنبي لما عندما ويقول من التقليدية الكونجرس الأراضي العام تحديا السياسات أمور وضد وقال ذلك بخصوص في كما وهي دراسة دولة من التقرير الذي يعرف هيا المعارضة وصول الكونجرس ده الملف لماذا كنتم انتصرت الإسلاميين النظم وفي جندي مصر وسهولة بأسلحة لمن إلى في ع السوري لزيادة والأمنية تحقيق تصل حاجة بين العربية عن أكد سوف لسياسات عقلية في العالم الثائرة الجارية مع مقدمة والتوصيف الساعي التقرير أميركا على تمتلك وشعور باسم أبحاث فيه المجلس هامة التى الاستعداد لا نصيحة الخليج بسياساتها معاك على المتحدة بالدفاع إلى مما أن بلا و للسعودية ويشير علاقتهم ألف الشهر ارجو الثورات وخاصة دفاعية حماية تتعاون العربية وإيران تهدد بن أيدلوجياتهم تجاه ستهتم مناطق يبقى اتجاه  التقرير الخليج، إلى القاعدة وأن لم",
             };
        static string[] names = new string[] {"محمد محمود ",
        "رضوان الرضوان",
        "عيسى العيسى",
        "نعمان النعمان",
        "هاشم الهواشم",
        "ياسمن الشام","",
        "زمبق حلب","وردة حلب",};


        public static async Task InitializeAsync(IServiceProvider services)
        {
            var context = (JolijoberService)services.GetService(typeof(JolijoberService));

            var ContextPost = context.MongoService.GetCollection<Post>(PluralizationProvider.Pluralize(typeof(Post).Name));
            long count = await ContextPost.CountAsync(x=>true);


            IEnumerable<Post> ranposts = Enumerable.Range(0, 12).Select(x => new Post()
            {
                Date = DateTime.Now,
                Title = titels[random.Next(0, titels.Length - 1)],
                Sallaries = new MinMax(82, 40),
                Availabilty = Availabilties.PartTime,
                Descreption = dess[random.Next(0, dess.Length - 1)],
                Tags = new[] { "Java", "Android" },
                Specifications = new[] { "شركة برمجية" },
                Region = "سوريا-العالم",
                Likes = new Like[] { new Like() { Liker = "مرا من هنا لايك", LikerId = "asd8489" } },
                Comments = new Comment[]{
                    new Comment() { CommenterId= "asd8489", Commenter=names[random.Next(0, names.Length - 1)],Date=DateTime.Now,Text="سوف اقوم بالمراسلة", },
                },
                Views = 0,
                AccountId = "86545112",
                AccountName = names[random.Next(0, names.Length - 1)],
                AccountType = AccountTypes.User,
                PostType = PostTypes.Job
            } );



            IEnumerable<Post> posts = new List<Post>()
            {
               new Post(){
                Date=DateTime.Now,
                Title="مطور تطبيقات ويب" ,
                Sallaries=new MinMax(600,800) ,
                Availabilty=Availabilties.FullTime,
                Descreption="خبرة في مجال الويب شغف يعمل بجد يحتاج لإتمام إطارين عمل على الاقل يفضل ان يكون خريج والخبرة جيدة في الدوت نت",
                Tags= new[]{"C#","dotNet" }  ,
                Specifications=new[]{ "مطور ويب كامل" },
                Region="سوريا-حلب" ,
                //Likes= new Like[]{ },
                //Comments= new Comment[]{ },
                Views=0,
                AccountId="894545456" ,
                AccountName= "طيب الطيب",
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},

                 new Post(){
                Date=DateTime.Now,
                Title="مطور تطبيقات اندرويد" ,
                Sallaries=new MinMax(200,400) ,
                Availabilty=Availabilties.PartTime,
                Descreption="خبير في تطبيقات الاتدرويد يتقن استخلاص واجهات جميلة",
                Tags= new[]{"Java","Android" }  ,
                Specifications=new[]{ "مطور تطبيقات اندرويد" },
                Region="سوريا-دمشق" ,
                 Likes= new Like[]{ new Like() { Liker="طيب الطيب" ,LikerId= "asd8489" } },
                Comments= new Comment[]{
                    new Comment() { CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="asdad", },
                   new Comment() { CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="asdad",
                   ChildComments= new Comment[]{  new Comment() {
                       CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="asdad",
                       ChildComments  = new Comment[] {
                           new Comment() {
                               CommenterId = "asd8489", Commenter = "طيب الطيب", Date = DateTime.Now, Text = "asdad"},
                           new Comment() { CommenterId = "asd8489", Commenter = "طيب الطيب", Date = DateTime.Now, Text = "asdad", }
                       } }, new Comment() { CommenterId = "asd8489", Commenter = "طيب الطيب", Date = DateTime.Now, Text = "asdad", } }
                   }
                         ,new Comment() { CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="asdad", },
                },
                Views=0,
                AccountId="86545112",
                AccountName= "محمد حذيفة أصيل",
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},



                    new Post(){
                Date=DateTime.Now,
                Title="مطور تطبيقات اندرويد" ,
                Sallaries=new MinMax(200,400) ,
                Availabilty=Availabilties.PartTime,
                Descreption="خبير في تطبيقات الاتدرويد يتقن استخلاص واجهات جميلة",
                Tags= new[]{"Java","Android" }  ,
                Specifications=new[]{ "مطور تطبيقات اندرويد" },
                Region="سوريا-دمشق" ,
                 Likes= new Like[]{ new Like() { Liker="طيب الطيب" ,LikerId= "asd8489" } },
                Comments= new Comment[]{
                    new Comment() { CommenterId= "asd8489", Commenter="شخص ما",Date=DateTime.Now,Text="سوف اثوم بالمراسلة", },
                },
                Views=0,
                AccountId="86545112",
                AccountName= "محمد حذيفة أصيل",
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},



             new Post(){
                Date=DateTime.Now,
                Title=titels[random.Next(0,titels.Length-1)] ,
                Sallaries=new MinMax(82,40) ,
                Availabilty=Availabilties.PartTime,
                Descreption=dess[random.Next(0,dess.Length-1)],
                Tags= new[]{"Java","Android" }  ,
                Specifications=new[]{ "شركة برمجية" },
                Region="سوريا-العالم" ,
                 Likes= new Like[]{ new Like() { Liker="مرا من هنا لايك" ,LikerId= "asd8489" } },
                Comments= new Comment[]{
                    new Comment() { CommenterId= "asd8489", Commenter="شخص ما",Date=DateTime.Now,Text="سوف اقوم بالمراسلة", },
                },
                Views=0,
                AccountId="86545112",
                AccountName= names[random.Next(0,names.Length-1)],
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},




                     new Post(){
                Date=DateTime.Now,
                Title="مبرمج تطبيقات جوال" ,
                Sallaries=new MinMax(40,20) ,
                Availabilty=Availabilties.FullTime,
                Descreption="خبرة في مجال الويب شغف يعمل بجد يحتاج لإتمام إطارين عمل على الاقل يفضل ان يكون خريج والخبرة جيدة في الدوت نت",
                Tags= new[]{"C#","dotNet" }  ,
                Specifications=new[]{ "مطور ويب كامل" },
                Region="سوريا-حلب" ,
                //Likes= new Like[]{ },
                //Comments= new Comment[]{ },
                Views=0,
                AccountId="894545456" ,
                AccountName= "طيب الطيب",
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},

                 new Post(){
                Date=DateTime.Now,
                Title="مطور تطبيقات اندرويد" ,
                Sallaries=new MinMax(200,400) ,
                Availabilty=Availabilties.PartTime,
                Descreption="خبير في تطبيقات الاتدرويد يتقن استخلاص واجهات جميلة",
                Tags= new[]{"Java","Android" }  ,
                Specifications=new[]{ "مطور تطبيقات اندرويد" },
                Region="سوريا-دمشق" ,
                 Likes= new Like[]{ new Like() { Liker="حذيفة أصيل" ,LikerId= "asd8489" } },
                Comments= new Comment[]{
                    new Comment() { CommenterId= "asd8489", Commenter="عبد العزيز",Date=DateTime.Now,Text="الراتب", },
                   new Comment() { CommenterId= "asd8489", Commenter="محمد أحمد ",Date=DateTime.Now,Text="asdad",
                   ChildComments= new Comment[]{  new Comment() {
                       CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="سعر الساعة",
                       ChildComments  = new Comment[] {
                           new Comment() {
                               CommenterId = "asd8489", Commenter = "طيب الطيب", Date = DateTime.Now, Text = "عمل جيد "},
                         
                       } }, new Comment() { CommenterId = "جميل", Commenter = "ام كلثوم", Date = DateTime.Now, Text = "كيف يمكن احصل على ذلك العمل", } }
                   }
                         ,new Comment() { CommenterId= "asd8489", Commenter="طيب الطيب",Date=DateTime.Now,Text="غير واضح", },
                },
                Views=10,
                AccountId="86545112",
                AccountName= "محمد حذيفة أصيل",
                AccountType=AccountTypes.User,
                PostType=PostTypes.Job},


            };
       //    if (count==0)
            await ContextPost.InsertManyAsync(posts.Concat(ranposts));
        }
    }
}
